cases/ansys_verification/VMFL022/case/0.orig/epsilon
FoamFile { version 2.0; format ascii; class volScalarField; object epsilon; }
dimensions [0 2 -3 0 0 0 0];
internalField uniform 10;
boundaryField
{
    inlet   { type turbulentMixingLengthDissipationRateInlet; mixingLength 0.00161; value uniform 10; }
    outlet  { type inletOutlet; inletValue uniform 10; value uniform 10; }
    orificeWall { type epsilonWallFunction; value uniform 10; }
    stepWall    { type epsilonWallFunction; value uniform 10; }
    pipeWall    { type epsilonWallFunction; value uniform 10; }
    wedgeFront  { type wedge; }
    wedgeBack   { type wedge; }
    axis        { type empty; }
}
