cases/ansys_verification/VMFL022/case/0.orig/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 1;
boundaryField
{
    inlet   { type turbulentIntensityKineticEnergyInlet; intensity 0.05; value uniform 1; }
    outlet  { type inletOutlet; inletValue uniform 1; value uniform 1; }
    orificeWall { type kqRWallFunction; value uniform 1; }
    stepWall    { type kqRWallFunction; value uniform 1; }
    pipeWall    { type kqRWallFunction; value uniform 1; }
    wedgeFront  { type wedge; }
    wedgeBack   { type wedge; }
    axis        { type empty; }
}
