cases/ansys_verification/VMFL022/case/0.orig/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet   { type calculated; value uniform 0; }
    outlet  { type calculated; value uniform 0; }
    orificeWall { type nutkWallFunction; value uniform 0; }
    stepWall    { type nutkWallFunction; value uniform 0; }
    pipeWall    { type nutkWallFunction; value uniform 0; }
    wedgeFront  { type wedge; }
    wedgeBack   { type wedge; }
    axis        { type empty; }
}
