cases/ansys_verification/VMFL022/case/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| VMFL021/022 Nurick sharp-edged orifice -- axisymmetric 5deg wedge          |
| GENERATED by gen_mesh.py (birth-certified).  Cell counts are PLACEHOLDERS  |
| substituted by the launcher per Roache level (ratio 2). Geometry is FIXED. |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0; format ascii; class dictionary; object blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0 0 0) // 0
    (0 0 -0) // 1
    (0 0.00399619289 0.000174477549) // 2
    (0 0.00399619289 -0.000174477549) // 3
    (0 0.0114890545 0.000501622955) // 4
    (0 0.0114890545 -0.000501622955) // 5
    (0.016 0 0) // 6
    (0.016 0 -0) // 7
    (0.016 0.00399619289 0.000174477549) // 8
    (0.016 0.00399619289 -0.000174477549) // 9
    (0.016 0.0114890545 0.000501622955) // 10
    (0.016 0.0114890545 -0.000501622955) // 11
    (0.048 0 0) // 12
    (0.048 0 -0) // 13
    (0.048 0.00399619289 0.000174477549) // 14
    (0.048 0.00399619289 -0.000174477549) // 15
);

blocks
(
    hex (1 7 9 3 0 6 8 2)    (__NX1__ __N2R__ 1) simpleGrading (1 1 1)   // upstream inner (0..r2)
    hex (3 9 11 5 2 8 10 4)  (__NX1__ __N1R__ 1) simpleGrading (1 __G1R__ 1) // upstream outer (r2..r1)
    hex (7 13 15 9 6 12 14 8)(__NX2__ __N2R__ 1) simpleGrading (__GX2__ 1 1) // orifice (0..r2)
);

edges ( );

boundary
(
    inlet
    {
        type patch;
        faces ( (0 2 3 1) (2 4 5 3) );
    }
    outlet
    {
        type patch;
        faces ( (12 14 15 13) );
    }
    orificeWall
    {
        type wall;
        faces ( (9 15 14 8) );
    }
    stepWall
    {
        type wall;
        faces ( (8 10 11 9) );
    }
    pipeWall
    {
        type wall;
        faces ( (5 11 10 4) );
    }
    wedgeFront
    {
        type wedge;
        faces ( (0 6 8 2) (2 8 10 4) (6 12 14 8) );
    }
    wedgeBack
    {
        type wedge;
        faces ( (1 7 9 3) (3 9 11 5) (7 13 15 9) );
    }
    axis
    {
        type empty;
        faces ( (1 7 6 0) (7 13 12 6) );
    }
);

mergePatchPairs ( );

// ************************************************************************* //
