cases/ansys_verification/VMFL022/case/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
// VMFL022 Case B (low inlet pressure).  Transient interPhaseChangeFoam, run to
// a statistically-steady discharge.  dt is Courant-limited (adjustTimeStep),
// so the Roache family (spatial x2) auto-refines dt with the mesh -- the triple
// therefore measures the COMBINED space-time discretisation error.
application     interPhaseChangeFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.06;
deltaT          1e-7;
writeControl    adjustable;
writeInterval   0.01;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable false;
adjustTimeStep  yes;
maxCo           5;
maxAlphaCo      5;
maxDeltaT       5e-5;

functions
{
    outletMassFlow
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            outlet;
        operation       sum;
        fields          (phi);
        writeFields     false;
        surfaceFormat   none;
        writeControl    timeStep;
        writeInterval   1;
        log             false;
    }
    inletMassFlow
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          (phi);
        writeFields     false;
        surfaceFormat   none;
        writeControl    timeStep;
        writeInterval   1;
        log             false;
    }
}
