cases/ansys_verification/VMFL022/case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    "alpha.water.*"
    {
        cAlpha 0; nAlphaCorr 2; nAlphaSubCycles 1;
        MULESCorr yes; nLimiterIter 5;
        solver smoothSolver; smoother symGaussSeidel;
        tolerance 1e-8; relTol 0; maxIter 10;
    }
    "U.*" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-7; relTol 0; }
    "(k|epsilon).*" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0; }
    p_rgh { solver GAMG; tolerance 1e-8; relTol 0.05; smoother DICGaussSeidel; maxIter 50; }
    p_rghFinal { $p_rgh; relTol 0; }
    "pcorr.*" { $p_rgh; relTol 0; }
    Phi { $p_rgh; relTol 0; }
}
potentialFlow { nNonOrthogonalCorrectors 3; }
PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors 3;
    nNonOrthogonalCorrectors 1;
}
relaxationFactors { equations { "U.*" 1; "(k|epsilon).*" 1; } }
